{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_ids": 0,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "high Coverage",
    "1": "high Exclusion",
    "2": "high Limitation",
    "3": "high Monetary",
    "4": "high Waiting Period",
    "5": "low Coverage",
    "6": "low Exclusion",
    "7": "low Limitation",
    "8": "moderate Coverage",
    "9": "moderate Exclusion",
    "10": "moderate Monetary",
    "11": "moderate Waiting Period"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "high Coverage": 0,
    "high Exclusion": 1,
    "high Limitation": 2,
    "high Monetary": 3,
    "high Waiting Period": 4,
    "low Coverage": 5,
    "low Exclusion": 6,
    "low Limitation": 7,
    "moderate Coverage": 8,
    "moderate Exclusion": 9,
    "moderate Monetary": 10,
    "moderate Waiting Period": 11
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.55.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
